apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce.h
    struct {
      __IOM uint32_t aes_key_w3 : 32;           /*!< [31..0] The key bit[127:96]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs this 128bits key.                                                   */
    } sce_aes_key_pair1_w3_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair1_w0;         /*!< (@ 0x00000020) SCE IV Key Word0 of the Pair 1 Register                    */

    struct {
      __IOM uint32_t aes_iv_w0  : 32;           /*!< [31..0] The IV bit[31:0]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs the initial vector generated by SCE_IV_KEY_PAIR_1.                  */
    } sce_aes_iv_pair1_w0_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair1_w1;         /*!< (@ 0x00000024) SCE IV Key Word1 of the Pair 1 Register                    */

    struct {
      __IOM uint32_t aes_iv_w1  : 32;           /*!< [31..0] The IV bit[63:31]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs the initial vector generated by SCE_IV_KEY_PAIR_1.                  */
    } sce_aes_iv_pair1_w1_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair1_w2;         /*!< (@ 0x00000028) SCE IV Key Word2 of the Pair 1 Register                    */

    struct {
      __IOM uint32_t aes_iv_w2  : 32;           /*!< [31..0] The IV bit[95:64]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs the initial vector generated by SCE_IV_KEY_PAIR_1.                  */
    } sce_aes_iv_pair1_w2_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair1_w3;         /*!< (@ 0x0000002C) SCE IV Key Word3 of the Pair 1 Register                    */

    struct {
      __IOM uint32_t aes_iv_w3  : 32;           /*!< [31..0] The IV bit[127:96]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs the initial vector generated by SCE_IV_KEY_PAIR_1.                  */
    } sce_aes_iv_pair1_w3_b;
  } ;

  union {
    __IOM uint32_t sce_aes_key_pair2_w0;        /*!< (@ 0x00000030) SCE AES Key of the Pair 2 Word0 Register                   */

    struct {
      __IOM uint32_t aes_key_w0 : 32;           /*!< [31..0] The key bit[31:0]. The user chose the pair 2 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs this 128bits key.                                                   */
    } sce_aes_key_pair2_w0_b;
  } ;

  union {
    __IOM uint32_t sce_aes_key_pair2_w1;        /*!< (@ 0x00000034) SCE AES Key of the Pair 2 Word1 Register                   */

    struct {
      __IOM uint32_t aes_key_w1 : 32;           /*!< [31..0] The key bit[63:32]. The user chose the pair 2 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs this 128bits key.                                                   */
    } sce_aes_key_pair2_w1_b;
  } ;

  union {
    __IOM uint32_t sce_aes_key_pair2_w2;        /*!< (@ 0x00000038) SCE AES Key of the Pair 2 Word2 Register                   */

    struct {
      __IOM uint32_t aes_key_w2 : 32;           /*!< [31..0] The key bit[95:64]. The user chose the pair 2 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs this 128bits key.                                                   */
    } sce_aes_key_pair2_w2_b;
  } ;

  union {
    __IOM uint32_t sce_aes_key_pair2_w3;        /*!< (@ 0x0000003C) SCE AES Key of the Pair 2 Word3 Register                   */

    struct {
      __IOM uint32_t aes_key_w3 : 32;           /*!< [31..0] The key bit[127:96]. The user chose the pair 2 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs this 128bits key.                                                   */
    } sce_aes_key_pair2_w3_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair2_w0;         /*!< (@ 0x00000040) SCE IV Key Word0 of the Pair 2 Register                    */

    struct {
      __IOM uint32_t aes_iv_w0  : 32;           /*!< [31..0] The IV bit[31:0]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs the initial vector generated by SCE_IV_KEY_PAIR_2.                  */
    } sce_aes_iv_pair2_w0_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair2_w1;         /*!< (@ 0x00000044) SCE IV Key Word1 of the Pair 2 Register                    */

    struct {
      __IOM uint32_t aes_iv_w1  : 32;           /*!< [31..0] The IV bit[63:31]. The user chose the pair 1 to protect
                                                     the code. When SCE want encrypt or decrypt the data, it
                                                     needs the initial vector generated by SCE_IV_KEY_PAIR_2.                  */
    } sce_aes_iv_pair2_w1_b;
  } ;

  union {
    __IOM uint32_t sce_aes_iv_pair2_w2;         /*!< (@ 0x00000048) SCE IV Key Word2 of the Pair 2 Register                    */

