apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce.h
    struct {
      __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                     configure the start page number. The definition of page
                                                     is defined in Chapter 4.                                                  */
      __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                     configure the end page number. The definition of page is
                                                     defined in Chapter 4                                                      */
      __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                     0: The key pair 1 1: The key pair 2                                       */
      __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                     section is disabled. 1: Data encryption of this section
                                                     is enabled.                                                               */
      __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                     of this section is disabled. 1: Address remapping of this
                                                     section is enabled..                                                      */
    } sce_sect4_b;
  } ;

  union {
    __IOM uint32_t sce_sect5;                   /*!< (@ 0x00000060) SCE Secure Section 5 Register                              */

    struct {
      __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                     configure the start page number. The definition of page
                                                     is defined in Chapter 4.                                                  */
      __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                     configure the end page number. The definition of page is
                                                     defined in Chapter 4                                                      */
      __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                     0: The key pair 1 1: The key pair 2                                       */
      __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                     section is disabled. 1: Data encryption of this section
                                                     is enabled.                                                               */
      __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                     of this section is disabled. 1: Address remapping of this
                                                     section is enabled..                                                      */
    } sce_sect5_b;
  } ;

  union {
    __IOM uint32_t sce_sect6;                   /*!< (@ 0x00000064) SCE Secure Section 6 Register                              */

    struct {
      __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                     configure the start page number. The definition of page
                                                     is defined in Chapter 4.                                                  */
      __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                     configure the end page number. The definition of page is
                                                     defined in Chapter 4                                                      */
      __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                     0: The key pair 1 1: The key pair 2                                       */
      __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                     section is disabled. 1: Data encryption of this section
                                                     is enabled.                                                               */
      __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                     of this section is disabled. 1: Address remapping of this
                                                     section is enabled..                                                      */
    } sce_sect6_b;
  } ;

  union {
    __IOM uint32_t sce_sect7;                   /*!< (@ 0x00000068) SCE Secure Section 7 Register                              */

    struct {
      __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                     configure the start page number. The definition of page
                                                     is defined in Chapter 4.                                                  */
      __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                     configure the end page number. The definition of page is
                                                     defined in Chapter 4                                                      */
      __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                     0: The key pair 1 1: The key pair 2                                       */
      __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                     section is disabled. 1: Data encryption of this section
                                                     is enabled.                                                               */
      __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                     of this section is disabled. 1: Address remapping of this
                                                     section is enabled..                                                      */
    } sce_sect7_b;
  } ;

  union {
    __IOM uint32_t sce_sect8;                   /*!< (@ 0x0000006C) SCE Secure Section 8 Register                              */

