apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce.h
    struct {
      __IOM uint32_t start_page : 12;           /*!< [11..0] If the users want to enable secure section, they need
                                                     configure the start page number. The definition of page
                                                     is defined in Chapter 4.                                                  */
      __IOM uint32_t end_page   : 12;           /*!< [23..12] If the users want to enable secure section, they need
                                                     configure the end page number. The definition of page is
                                                     defined in Chapter 4                                                      */
      __IOM uint32_t key_pair_id : 3;           /*!< [26..24] The users can chose one key pair from the two sets.
                                                     0: The key pair 1 1: The key pair 2                                       */
      __IOM uint32_t secure_en  : 1;            /*!< [27..27] data encryption control: 0: Data encryption of this
                                                     section is disabled. 1: Data encryption of this section
                                                     is enabled.                                                               */
      __IOM uint32_t remap_en   : 1;            /*!< [28..28] memory address remaping control 0: Address remapping
                                                     of this section is disabled. 1: Address remapping of this
                                                     section is enabled..                                                      */
    } sce_sect8_b;
  } ;

  union {
    __IOM uint32_t sce_remap1;                  /*!< (@ 0x00000070) SCE Secure Section Remap 1 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap1_b;
  } ;

  union {
    __IOM uint32_t sce_remap2;                  /*!< (@ 0x00000074) SCE Secure Section Remap 2 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap2_b;
  } ;

  union {
    __IOM uint32_t sce_remap3;                  /*!< (@ 0x00000078) SCE Secure Section Remap 3 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap3_b;
  } ;

  union {
    __IOM uint32_t sce_remap4;                  /*!< (@ 0x0000007C) SCE Secure Section Remap 4 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap4_b;
  } ;

  union {
    __IOM uint32_t sce_remap5;                  /*!< (@ 0x00000080) SCE Secure Section Remap 5 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap5_b;
  } ;

  union {
    __IOM uint32_t sce_remap6;                  /*!< (@ 0x00000084) SCE Secure Section Remap 6 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap6_b;
  } ;

  union {
    __IOM uint32_t sce_remap7;                  /*!< (@ 0x00000088) SCE Secure Section Remap 7 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap7_b;
  } ;

  union {
    __IOM uint32_t sce_remap8;                  /*!< (@ 0x0000008C) SCE Secure Section Remap 8 Register                        */

    struct {
      __IOM uint32_t phy_addr   : 32;           /*!< [31..0] The physical address to be remap to the address assigned
                                                     by the Secure Section register.                                           */
    } sce_remap8_b;
  } ;
} SCE_Type;                                     /*!< Size = 144 (0x90)                                                         */


/** @} */ /* End of group Peripheral_SCE */

/// @endcond /* End of condition DOXYGEN_REG_ENCLOSED */

#include "rtl8710c_sce_type.h"

/// SCE control register offset.
#define REG_SCE_CTRL                (0x0)
/// SCE key pair 1 key data register offset.
#define REG_SCE_AES_KEY_PAIR1       (0x10 >> 2)
/// SCE key pair 1 IV data register offset.
#define REG_SCE_IV_PAIR1            (0x20 >> 2)
/// SCE key pair 2 key data register offset.
#define REG_SCE_AES_KEY_PAIR2       (0x30 >> 2)
/// SCE key pair 2 IV data register offset.
#define REG_SCE_IV_PAIR2            (0x40 >> 2)
/// SCE section 1 control register offset.
#define REG_SCE_SEC1                (0x50 >> 2)
/// SCE section 2 control register offset.
#define REG_SCE_SEC2                (0x54 >> 2)
/// SCE section 3 control register offset.
#define REG_SCE_SEC3                (0x58 >> 2)
/// SCE section 4 control register offset.
#define REG_SCE_SEC4                (0x5C >> 2)
/// SCE section 5 control register offset.
#define REG_SCE_SEC5                (0x60 >> 2)
/// SCE section 6 control register offset.
#define REG_SCE_SEC6                (0x64 >> 2)
/// SCE section 7 control register offset.
#define REG_SCE_SEC7                (0x68 >> 2)
/// SCE section 8 control register offset.
#define REG_SCE_SEC8                (0x6C >> 2)
/// SCE section 1 remapping address register offset.
#define REG_SCE_SEC1_REMAP          (0x70 >> 2)
/// SCE section 2 remapping address register offset.
#define REG_SCE_SEC2_REMAP          (0x74 >> 2)
/// SCE section 3 remapping address register offset.
#define REG_SCE_SEC3_REMAP          (0x78 >> 2)
/// SCE section 4 remapping address register offset.
#define REG_SCE_SEC4_REMAP          (0x7C >> 2)
/// SCE section 5 remapping address register offset.
#define REG_SCE_SEC5_REMAP          (0x80 >> 2)
/// SCE section 6 remapping address register offset.
#define REG_SCE_SEC6_REMAP          (0x84 >> 2)
/// SCE section 7 remapping address register offset.
#define REG_SCE_SEC7_REMAP          (0x88 >> 2)
/// SCE section 8 remapping address register offset.
#define REG_SCE_SEC8_REMAP          (0x8C >> 2)

/// the maximum section index of the SCE hardware. A SCE hardware support up to 8 sections of memory.
#define SCE_MAX_SECTION_ID          7
/// the maximum key pair index value. Since a SCE hardware has 2 key pairs. So the maximum key pair index is 1.
#define SCE_MAX_KEY_PAIR_ID         1

