apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sce.h
/// the length of SCE key data.
#define SCE_KEY_LEN                 16
/// the length of SCE IV(initial value) data.
#define SCE_IV_LEN                  16

/**
  \brief  Defines the memory type for the SCE function works with.
*/
enum sce_mem_type_e {
    SCE_TYPE_LPDDR      = 0,    ///< Low power DDR DRAM
    SCE_TYPE_PSRAM      = 1,    ///< Pseudo SRAM
    SCE_TYPE_FLASH      = 2     ///< Flash memory
};
typedef uint8_t sce_mem_type_t;

/**
  \brief  Defines the memory operation mode of the SCE function.
*/
enum sce_mode_select_e {
    ReadMode            = 0,    ///< Read only
    WriteMode           = 1,    ///< Write only
    ReadWriteMode       = 2     ///< supports both read and write
};
typedef uint8_t sce_mode_select_t;

/**
  \brief  Defines the memory page size for the SCE operation (encryption, decryption and remapping).
*/
enum sce_page_size_e {
    Page16KB            = 0,    ///< page size = 16K bytes
    Page32KB            = 1,    ///< page size = 32K bytes
    Page64KB            = 2     ///< page size = 64K bytes
};
typedef uint8_t sce_page_size_t;

/**
  \brief  Defines the memory block size for the SCE to do data encryption or decryption.
          The SCE use the same key for the data encryption and decryption in a block.
*/
enum sce_block_size_e {
    Block32Bytes        = 0,    ///< block size = 32 bytes
    Block64Bytes        = 1,    ///< block size = 64 bytes
    Block128Bytes       = 2,    ///< block size = 128 bytes
    Block256Bytes       = 3     ///< block size = 256 bytes
};
typedef uint8_t sce_block_size_t;

/**
  \brief  The data structure for the SCE common resource handling.
*/
typedef struct hal_sce_group_adaptor_s {
    uint8_t  flash_section_en; /*!<  bit map of flash section 1 ~ 8 enable */
//    uint8_t  exmem_section_en; /*!<  bit map of ext. mem 1 ~ 8 enable */
    uint8_t  flash_key_inited; /*!<  bit map of flash key 1 ~ 2 initialed */
//    uint8_t  exmem_key_inited; /*!<  bit map of ext. mem key 1 ~ 2 initialed */
} hal_sce_group_adaptor_t, *phal_sce_group_adaptor_t;

typedef struct hal_sce_check_info_s {
    uint32_t key_check[4] __attribute__((aligned(16)));
    uint32_t iv_check[4] __attribute__((aligned(16)));

} hal_sce_check_info_t, *phal_sce_check_info_t;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_sce_rom_func SCE HAL ROM APIs.
 * @ingroup hs_hal_sce
 * @{
 */

void hal_sce_write_reg_rtl8710c (uint32_t addr, uint32_t value);
uint32_t hal_sce_read_reg_rtl8710c (uint32_t addr);
uint8_t hal_sce_comm_alloc_section_rtl8710c (void);
void hal_sce_comm_free_section_rtl8710c (uint8_t sec_id);
BOOLEAN hal_sce_comm_key_valid_rtl8710c (uint8_t pair_id);
void hal_sce_comm_set_key_valid_rtl8710c (uint8_t pair_id);
hal_status_t hal_sce_func_enable_rtl8710c (void);
hal_status_t hal_sce_func_disable_rtl8710c (void);
hal_status_t hal_sce_enable_rtl8710c (sce_page_size_t page_size,
                                        sce_block_size_t block_size, sce_mode_select_t rw_mode);
hal_status_t hal_sce_disable_rtl8710c (void);
void hal_sce_set_key_rtl8710c (uint8_t pair_id, uint8_t *key);
void hal_sce_set_iv_rtl8710c (uint8_t pair_id, uint8_t *iv);
void hal_sce_set_key_pair_rtl8710c (uint8_t pair_id, uint8_t *key, uint8_t *iv);
void hal_sce_read_key_pair_rtl8710c (uint8_t pair_id, uint8_t *key, uint8_t *iv);
uint8_t hal_sce_key_pair_search_rtl8710c (uint8_t *key, uint8_t *iv);
hal_status_t hal_sce_set_section_rtl8710c (uint8_t sec_id, uint8_t pair_id,
                                    uint32_t start_address, uint32_t end_address, uint8_t secure_en);
void hal_sce_section_disable_rtl8710c (uint8_t sec_id);
hal_status_t hal_sce_flash_remap_rtl8710c (uint32_t phy_addr, uint32_t vir_addr, uint32_t map_size,
                                             sce_page_size_t page_size_sel, uint8_t secure_en,
                                             sce_block_size_t block_size, uint8_t key_id);
hal_status_t hal_sce_set_mem_crypto_rtl8710c (uint32_t start_addr,
                                                uint32_t mem_size, uint8_t key_id);
hal_status_t hal_sce_remap_enable_rtl8710c (uint8_t sec_id, uint32_t phy_addr);
void hal_sce_reg_dump_rtl8710c (void);
hal_status_t hal_sce_cfg_rtl8710c (sce_page_size_t page_size,
                                     sce_block_size_t block_size, sce_mode_select_t rw_mode);
/// @endcond /* End of condition DOXYGEN_ROM_HAL_API */

typedef struct hal_sce_func_stubs_s {
    hal_sce_group_adaptor_t *psce_gpadp;
    void (*hal_sce_write_reg) (uint32_t addr, uint32_t value);
    uint32_t (*hal_sce_read_reg) (uint32_t addr);
    uint8_t (*hal_sce_comm_alloc_section) (void);
    void (*hal_sce_comm_free_section) (uint8_t sec_id);
    BOOLEAN (*hal_sce_comm_key_valid) (uint8_t pair_id);
    hal_status_t (*hal_sce_func_enable) (void);
    hal_status_t (*hal_sce_func_disable) (void);
    hal_status_t (*hal_sce_enable) (sce_page_size_t page_size,
                                    sce_block_size_t block_size, sce_mode_select_t rw_mode);
    hal_status_t (*hal_sce_disable) (void);
    hal_status_t (*hal_sce_cfg) (sce_page_size_t page_size,
                                 sce_block_size_t block_size, sce_mode_select_t rw_mode);
    void (*hal_sce_set_key) (uint8_t pair_id, uint8_t *key);
    void (*hal_sce_set_iv) (uint8_t pair_id, uint8_t *iv);
    void (*hal_sce_set_key_pair) (uint8_t pair_id, uint8_t *key, uint8_t *iv);
    void (*hal_sce_read_key_pair) (uint8_t pair_id, uint8_t *key, uint8_t *iv);
    uint8_t (*hal_sce_key_pair_search) (uint8_t *key, uint8_t *iv);
    hal_status_t (*hal_sce_set_section) (uint8_t sec_id, uint8_t pair_id,
                                        uint32_t start_address, uint32_t end_address, uint8_t secure_en);
    hal_status_t (*hal_sce_remap_enable) (uint8_t sec_id, uint32_t phy_addr);
    void (*hal_sce_section_disable) (uint8_t sec_id);
    hal_status_t (*hal_sce_flash_remap) (uint32_t phy_addr, uint32_t vir_addr, uint32_t map_size,
                                         sce_page_size_t page_size_sel, uint8_t secure_en,
                                         sce_block_size_t block_size, uint8_t key_id);
    hal_status_t (*hal_sce_set_mem_crypto) (uint32_t start_addr,
                                            uint32_t mem_size, uint8_t key_id);
    void (*hal_sce_reg_dump) (void);

    uint32_t reserved[4];
} hal_sce_func_stubs_t;

#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_SCE_H */


/** @} */ /* End of group hal_sce */


